# cli tools
neovim
fzf
ripgrep
fd
eza
bat
trash
gnu-sed
gawk
ggrep
coreutils
moreutils
romkatv/gitstatus/gitstatus
jq
ffmpeg # video file conversion
exiftool # photo metadata
imagemagick
tldr
poppler # pdf utils

# writing
pandoc
--cask inkscape
markdownlint-cli
graphviz

# dev
watchman
watchexec
gh
git-filter-repo
pre-commit
node
yarn
--cask docker
docker-compose
swiftlint
httpie
--cask chromium
--cask julia
act # to run github workflows locally
--cask postman
platformio # iot
--cask raspberry-pi-imager
pyenv
uv

# security
gnupg
pinentry-mac
age # encryption

# macos tools
--cask karabiner-elements
yqrashawn/goku/goku # karabiner.json generator
--cask kitty
--cask kindavim
--cask wooshy
--cask hammerspoon
--cask monitorcontrol
--cask rectangle
--cask nordvpn
--cask ubersicht

# apps
--cask telegram
--cask signal
--cask anki
