# cli tools
neovim
fzf
ripgrep
fd
eza
bat
trash
bash
gnu-sed
gawk
grep # gnu grep, also for https://github.com/lincheney/fzf-tab-completion/pull/73
coreutils
moreutils
romkatv/gitstatus/gitstatus
jq
ffmpeg # video file conversion
exiftool # photo metadata
imagemagick
tldr
poppler # pdf utils

# writing
pandoc
basictex
--cask inkscape
markdownlint-cli
graphviz

# dev
watchman
watchexec
gh
git-filter-repo
pre-commit
node
yarn
--cask docker
docker-compose
swiftlint
httpie
--cask chromium
--cask julia
--cask bruno
platformio # iot
--cask raspberry-pi-imager
uv
web-ext # firefox extensions

# language servers
lua-language-server
pyright
bash-language-server
cmake-language-server
dockerfile-language-server
yaml-language-server
vscode-langservers-extracted
typescript-language-server
tailwindcss-language-server
marksman

# security
gnupg
pinentry-mac
age # encryption

# macos tools
--cask karabiner-elements
--cask kitty
--cask kindavim
--cask wooshy
--cask hammerspoon
--cask monitorcontrol
--cask nordvpn
FelixKratz/formulae/sketchybar

# apps
--cask telegram
--cask signal
--cask anki
--cask zen
